Revit 2016 API
FamilyItemFactory Methods
The FamilyItemFactory type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
NewAlignment
Add a new locked alignment into the Autodesk Revit document.
 (Inherited from ItemFactoryBase.)
NewAngularDimension(View, Arc, Reference, Reference)
 Creates a new angular dimension object using the default dimension type.
NewAngularDimension(View, Arc, Reference, Reference, DimensionType)
 Creates a new angular dimension object using the specified dimension type.
NewArcLengthDimension(View, Arc, Reference, Reference, Reference)
 Creates a new arc length dimension object using the default dimension type.
NewArcLengthDimension(View, Arc, Reference, Reference, Reference, DimensionType)
 Creates a new arc length dimension object using the specified dimension type.
NewBlend
Add a new Blend instance into the Autodesk Revit family document.
NewControl
Add a new control into the Autodesk Revit family document.
NewCurveByPoints
Create a 3d curve through two or more points in an Autodesk Revit family document.
NewDetailCurve
 Creates a new detail curve element.
 (Inherited from ItemFactoryBase.)
NewDetailCurveArray
 Creates an array of new detail curve elements.
 (Inherited from ItemFactoryBase.)
NewDiameterDimension
 Creates a new diameter dimension object using the default dimension type.
NewDimension(View, Line, ReferenceArray)
 Creates a new linear dimension object using the default dimension style.
 (Inherited from ItemFactoryBase.)
NewDimension(View, Line, ReferenceArray, DimensionType)
 Creates a new linear dimension object using the specified dimension style.
 (Inherited from ItemFactoryBase.)
NewExtrusion
Add a new Extrusion instance into the Autodesk Revit family document.
NewExtrusionForm
Create new Form element by Extrude operation, and add it into the Autodesk Revit family document.
NewFamilyInstance(Face, Line, FamilySymbol)
Inserts a new instance of a family onto a face of an existing element, using a line on that face for its position, and a type/symbol.
 (Inherited from ItemFactoryBase.)
NewFamilyInstance(Line, FamilySymbol, View)
Add a line based detail family instance into the Autodesk Revit document, using an line and a view where the instance should be placed.
 (Inherited from ItemFactoryBase.)
NewFamilyInstance(Reference, Line, FamilySymbol)
Inserts a new instance of a family onto a face referenced by the input Reference instance, using a line on that face for its position, and a type/symbol.
 (Inherited from ItemFactoryBase.)
NewFamilyInstance(XYZ, FamilySymbol, StructuralType)
Inserts a new instance of a family into the document, using a location and a type/symbol.
 (Inherited from ItemFactoryBase.)
NewFamilyInstance(XYZ, FamilySymbol, View)
Add a new family instance into the Autodesk Revit document, using an origin and a view where the instance should be placed.
 (Inherited from ItemFactoryBase.)
NewFamilyInstance(Face, XYZ, XYZ, FamilySymbol)
Inserts a new instance of a family onto a face of an existing element, using a location, reference direction, and a type/symbol.
 (Inherited from ItemFactoryBase.)
NewFamilyInstance(Reference, XYZ, XYZ, FamilySymbol)
Inserts a new instance of a family onto a face referenced by the input Reference instance, using a location, reference direction, and a type/symbol.
 (Inherited from ItemFactoryBase.)
NewFamilyInstance(XYZ, FamilySymbol, Element, StructuralType)
Inserts a new instance of a family into the document, using a location, type/symbol, and the host element.
 (Inherited from ItemFactoryBase.)
NewFamilyInstance(XYZ, FamilySymbol, XYZ, Element, StructuralType)
Inserts a new instance of a family into the document, using a location, type/symbol, the host element and a reference direction.
 (Inherited from ItemFactoryBase.)
NewFamilyInstances2
 Creates Family instances within the document.
 (Inherited from ItemFactoryBase.)
NewFormByCap
Create new Form element by cap operation (to create a single-surface form), and add it into the Autodesk Revit family document.
NewFormByThickenSingleSurface
Create a new Form element by thickening a single-surface form, and add it into the Autodesk Revit family document.
NewGroup
Creates a new type of group.
 (Inherited from ItemFactoryBase.)
NewLevel |  Obsolete.
 Creates a new level.
 (Inherited from ItemFactoryBase.)
NewLinearDimension(View, Line, ReferenceArray)
 Generate a new linear dimension object using the default dimension type.
NewLinearDimension(View, Line, ReferenceArray, DimensionType)
 Creates a new linear dimension object using the specified dimension type.
NewLoftForm
Create new Form element by Loft operation, and add it into the Autodesk Revit family document.
NewModelCurve
 Creates a new model line element.
 (Inherited from ItemFactoryBase.)
NewModelCurveArray
 Creates an array of new model line elements.
 (Inherited from ItemFactoryBase.)
NewModelText
Create a model text in the Autodesk Revit family document.
NewOpening
Create an opening to cut the wall or ceiling.
NewRadialDimension(View, Reference, XYZ)
 Creates a new radial dimension object using the default dimension type.
NewRadialDimension(View, Reference, XYZ, DimensionType)
 Generate a new radial dimension object using a specified dimension type.
NewReferencePlane
 Creates a new instance of ReferencePlane.
 (Inherited from ItemFactoryBase.)
NewReferencePlane2
 Creates a new instance of ReferencePlane.
 (Inherited from ItemFactoryBase.)
NewReferencePoint(PointElementReference)
Create a reference point on an existing reference in an Autodesk Revit family document.
NewReferencePoint(Transform)
Create a reference point at a given location and with a given coordinate system in an Autodesk Revit family document.
NewReferencePoint(XYZ)
Create a reference point at a given location in an Autodesk Revit family document.
NewRevolution
Add a new Revolution instance into the Autodesk Revit family document.
NewRevolveForms
Create new Form elements by revolve operation, and add them into the Autodesk Revit family document.
NewSweep(Boolean, ReferenceArray, SweepProfile, Int32, ProfilePlaneLocation)
Adds a new sweep form into the family document, using an array of selected references as a 3D path.
NewSweep(Boolean, CurveArray, SketchPlane, SweepProfile, Int32, ProfilePlaneLocation)
Adds a new sweep form to the family document, using a path of curve elements.
NewSweptBlend(Boolean, Reference, SweepProfile, SweepProfile)
Adds a new swept blend into the family document, using a selected reference as the path.
NewSweptBlend(Boolean, Curve, SketchPlane, SweepProfile, SweepProfile)
Add a new swept blend into the family document, using a curve as the path.
NewSweptBlendForm
Create new Form element by swept blend operation, and add it into the Autodesk Revit family document.
NewSymbolicCurve
Create a symbolic curve in an Autodesk Revit family document.
NewTextNote(View, XYZ, XYZ, XYZ, Double, TextAlignFlags, String) |  Obsolete.
 Creates a new TextNote object without a leader.
 (Inherited from ItemFactoryBase.)
NewTextNote(View, XYZ, XYZ, XYZ, Double, TextAlignFlags, TextNoteLeaderTypes, TextNoteLeaderStyles, XYZ, XYZ, String) |  Obsolete.
 Creates a new text note with a single leader.
 (Inherited from ItemFactoryBase.)
PlaceGroup
Place an instance of a Model Group into the Autodesk Revit document, using a location and a group type.
 (Inherited from ItemFactoryBase.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace